nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt1186/common/pin_mux/pin_mux.c
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MIMXRT1186xxxxx
package_id: MIMXRT1186XVJ8C
mcu_data: ksdk2_0
processor_version: 0.0.0
pin_labels:
- {pin_num: B4, pin_signal: GPIO_AON_15, label: ETH0, identifier: ETH0;ETH0_RESET}
- {pin_num: C8, pin_signal: GPIO_AON_20, label: ETH2, identifier: ETH2;ETH2_RESET}
- {pin_num: H4, pin_signal: GPIO_EMC_B1_01, label: pin, identifier: pin;flexio_pin}
- {pin_num: L13, pin_signal: GPIO_AD_29, label: FLEXIO_SPI, identifier: FLEXIO_SPI}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

 #include "fsl_common.h"
 #include "fsl_iomuxc.h"
 #include "fsl_rgpio.h"
 #include "pin_mux.h"
 
 /* FUNCTION ************************************************************************************************************
  * 
  * Function Name : BOARD_InitBootPins
  * Description   : Calls initialization functions.
  * 
  * END ****************************************************************************************************************/
 void BOARD_InitBootPins(void) {
     BOARD_InitDEBUG_UARTPins();
 }
 
 /*
  * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
 BOARD_InitDEBUG_UARTPins:
 - options: {createDeInit: 'true', callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
 - pin_list:
   - {pin_num: B1, peripheral: LPUART1, signal: TXD, pin_signal: GPIO_AON_08, pull_keeper_select: Keeper, open_drain: Disable, drive_strength: High, slew_rate: Slow}
   - {pin_num: A6, peripheral: LPUART1, signal: RXD, pin_signal: GPIO_AON_09, pull_keeper_select: Keeper, open_drain: Disable, drive_strength: High, slew_rate: Slow}
  * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
  */
 
 /* FUNCTION ************************************************************************************************************
  *
  * Function Name : BOARD_InitDEBUG_UARTPins, assigned for the Cortex-M33 core.
  * Description   : Configures pin routing and optionally pin electrical features.
  *
  * END ****************************************************************************************************************/
 void BOARD_InitDEBUG_UARTPins(void) {
   CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */
 
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_AON_08_LPUART1_TX,          /* GPIO_AON_08 is configured as LPUART1_TX */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_AON_09_LPUART1_RX,          /* GPIO_AON_09 is configured as LPUART1_RX */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinConfig(
       IOMUXC_GPIO_AON_08_LPUART1_TX,          /* GPIO_AON_08 PAD functional properties : */
       0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                  Drive Strength Field: high driver
                                                  Pull / Keep Select Field: Pull Disable, Highz
                                                  Pull Up / Down Config. Field: Weak pull down
                                                  Open Drain Field: Disabled */
   IOMUXC_SetPinConfig(
       IOMUXC_GPIO_AON_09_LPUART1_RX,          /* GPIO_AON_09 PAD functional properties : */
       0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                  Drive Strength Field: high driver
                                                  Pull / Keep Select Field: Pull Disable, Highz
                                                  Pull Up / Down Config. Field: Weak pull down
                                                  Open Drain Field: Disabled */
 }
 
 
 /* FUNCTION ************************************************************************************************************
  *
  * Function Name : BOARD_InitDEBUG_UARTPins_deinit, assigned for the Cortex-M33 core.
  * Description   : This is a de-initialization function for 'BOARD_InitDEBUG_UARTPins' function.
  * It sets all pins features (routing, direction and electrical) to their after-reset state.
  * It also tries to route the previous peripheral signals to their default pins.
  *
  * END ****************************************************************************************************************/
 void BOARD_InitDEBUG_UARTPins_deinit(void) {
   CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */
 
   /* GPIO configuration on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_08 (pin B1) */
   rgpio_pin_config_t gpio1_pinB1_config = {
       .pinDirection = kRGPIO_DigitalInput,
       .outputLogic = 0U,
   };
   /* Initialize GPIO functionality on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_08 (pin B1) */
   RGPIO_PinInit(RGPIO1, 8U, &gpio1_pinB1_config);
   /* Configures GPIO pin interrupt/DMA request on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_08 (pin B1) */
   RGPIO_SetPinInterruptConfig(RGPIO1, 8U, kRGPIO_InterruptOutput0, kRGPIO_InterruptOrDMADisabled);
 
   /* GPIO configuration on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_09 (pin A6) */
   rgpio_pin_config_t gpio1_pinA6_config = {
       .pinDirection = kRGPIO_DigitalInput,
       .outputLogic = 0U,
   };
   /* Initialize GPIO functionality on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_09 (pin A6) */
   RGPIO_PinInit(RGPIO1, 9U, &gpio1_pinA6_config);
   /* Configures GPIO pin interrupt/DMA request on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_09 (pin A6) */
   RGPIO_SetPinInterruptConfig(RGPIO1, 9U, kRGPIO_InterruptOutput0, kRGPIO_InterruptOrDMADisabled);
 
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_AON_08_GPIO1_IO08,          /* GPIO_AON_08 is configured as GPIO1_IO08 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_AON_09_GPIO1_IO09,          /* GPIO_AON_09 is configured as GPIO1_IO09 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinConfig(
       IOMUXC_GPIO_AON_08_GPIO1_IO08,          /* GPIO_AON_08 PAD functional properties : */
       0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                  Drive Strength Field: high driver
                                                  Pull / Keep Select Field: Pull Enable
                                                  Pull Up / Down Config. Field: Weak pull down
                                                  Open Drain Field: Disabled */
   IOMUXC_SetPinConfig(
       IOMUXC_GPIO_AON_09_GPIO1_IO09,          /* GPIO_AON_09 PAD functional properties : */
       0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                  Drive Strength Field: high driver
                                                  Pull / Keep Select Field: Pull Enable
                                                  Pull Up / Down Config. Field: Weak pull down
                                                  Open Drain Field: Disabled */
 }
 
 
