nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt1186/common/pin_mux/pin_mux.c
 /*
  * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
 BOARD_InitCANPins:
 - options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
 - pin_list:
   - {pin_num: A8, peripheral: CAN1, signal: RX, pin_signal: GPIO_AON_01, software_input_on: Enable}
   - {pin_num: A10, peripheral: CAN1, signal: TX, pin_signal: GPIO_AON_00, software_input_on: Enable}
  * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
  */
 
 /* FUNCTION ************************************************************************************************************
  *
  * Function Name : BOARD_InitCANPins, assigned for the Cortex-M33 core.
  * Description   : Configures pin routing and optionally pin electrical features.
  *
  * END ****************************************************************************************************************/
 void BOARD_InitCANPins(void) {
   CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
   CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */
 
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_AON_00_CAN1_TX,             /* GPIO_AON_00 is configured as CAN1_TX */
       1U);                                    /* Software Input On Field: Force input path of pad GPIO_AON_00 */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_AON_01_CAN1_RX,             /* GPIO_AON_01 is configured as CAN1_RX */
       1U);                                    /* Software Input On Field: Force input path of pad GPIO_AON_01 */
 }
 
 
 /*
  * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
 BOARD_InitNETPins:
 - options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
 - pin_list:
   - {pin_num: B4, peripheral: RGPIO1, signal: 'gpio_io, 15', pin_signal: GPIO_AON_15, identifier: ETH0_RESET, direction: OUTPUT, gpio_init_state: 'true'}
   - {pin_num: C8, peripheral: RGPIO1, signal: 'gpio_io, 20', pin_signal: GPIO_AON_20, identifier: ETH2_RESET, direction: OUTPUT, gpio_init_state: 'true'}
   - {pin_num: L14, peripheral: NETC, signal: netc_emdc, pin_signal: GPIO_AD_30, slew_rate: Slow}
   - {pin_num: K14, peripheral: NETC, signal: netc_emdio, pin_signal: GPIO_AD_31, open_drain: Enable, slew_rate: Slow}
   - {pin_num: L8, peripheral: NETC_SWT_ETH0, signal: 'TX_DATA, 0', pin_signal: GPIO_EMC_B2_05}
   - {pin_num: K5, peripheral: NETC_SWT_ETH0, signal: 'TX_DATA, 1', pin_signal: GPIO_EMC_B2_06}
   - {pin_num: J6, peripheral: NETC_SWT_ETH0, signal: 'TX_DATA, 2', pin_signal: GPIO_EMC_B2_03}
   - {pin_num: J8, peripheral: NETC_SWT_ETH0, signal: 'TX_DATA, 3', pin_signal: GPIO_EMC_B2_04}
   - {pin_num: K7, peripheral: NETC_SWT_ETH0, signal: TX_EN, pin_signal: GPIO_EMC_B2_07}
   - {pin_num: L7, peripheral: NETC_SWT_ETH0, signal: TX_CLK, pin_signal: GPIO_EMC_B2_08, software_input_on: Enable}
   - {pin_num: L5, peripheral: NETC_SWT_ETH0, signal: 'RX_DATA, 0', pin_signal: GPIO_EMC_B2_09}
   - {pin_num: K6, peripheral: NETC_SWT_ETH0, signal: 'RX_DATA, 1', pin_signal: GPIO_EMC_B2_10}
   - {pin_num: J9, peripheral: NETC_SWT_ETH0, signal: 'RX_DATA, 2', pin_signal: GPIO_EMC_B2_01}
   - {pin_num: L9, peripheral: NETC_SWT_ETH0, signal: 'RX_DATA, 3', pin_signal: GPIO_EMC_B2_02}
   - {pin_num: L6, peripheral: NETC_SWT_ETH0, signal: RX_EN, pin_signal: GPIO_EMC_B2_11}
   - {pin_num: M7, peripheral: NETC_SWT_ETH0, signal: RX_ER, pin_signal: GPIO_EMC_B2_12}
   - {pin_num: H3, peripheral: NETC_SWT_ETH2, signal: 'TX_DATA, 0', pin_signal: GPIO_EMC_B1_27}
   - {pin_num: D5, peripheral: NETC_SWT_ETH2, signal: TX_EN, pin_signal: GPIO_EMC_B1_28}
   - {pin_num: E4, peripheral: NETC_SWT_ETH2, signal: TX_CLK, pin_signal: GPIO_EMC_B1_29}
   - {pin_num: F2, peripheral: NETC_SWT_ETH2, signal: 'RX_DATA, 0', pin_signal: GPIO_EMC_B1_30}
   - {pin_num: G2, peripheral: NETC_SWT_ETH2, signal: 'RX_DATA, 1', pin_signal: GPIO_EMC_B1_31}
   - {pin_num: J1, peripheral: NETC_SWT_ETH2, signal: RX_EN, pin_signal: GPIO_EMC_B1_32}
   - {pin_num: K1, peripheral: NETC_SWT_ETH2, signal: RX_ER, pin_signal: GPIO_EMC_B1_33}
   - {pin_num: L2, peripheral: NETC_SWT_ETH2, signal: 'RX_DATA, 2', pin_signal: GPIO_EMC_B1_34}
   - {pin_num: L1, peripheral: NETC_SWT_ETH2, signal: 'RX_DATA, 3', pin_signal: GPIO_EMC_B1_35}
   - {pin_num: F5, peripheral: NETC_SWT_ETH2, signal: 'TX_DATA, 3', pin_signal: GPIO_EMC_B1_36}
   - {pin_num: H2, peripheral: NETC_SWT_ETH2, signal: 'TX_DATA, 2', pin_signal: GPIO_EMC_B1_37}
   - {pin_num: J2, peripheral: NETC_SWT_ETH2, signal: RX_CLK, pin_signal: GPIO_EMC_B1_38}
  * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
  */
 
 /* FUNCTION ************************************************************************************************************
  *
  * Function Name : BOARD_InitNETPins, assigned for the Cortex-M33 core.
  * Description   : Configures pin routing and optionally pin electrical features.
  *
  * END ****************************************************************************************************************/
 void BOARD_InitNETPins(void) {
   CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
   CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */
 
   /* GPIO configuration of ETH0_RESET on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_15 (pin B4) */
   rgpio_pin_config_t ETH0_RESET_config = {
       .pinDirection = kRGPIO_DigitalOutput,
       .outputLogic = 1U,
   };
   /* Initialize GPIO functionality on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_15 (pin B4) */
   RGPIO_PinInit(RGPIO1, 15U, &ETH0_RESET_config);
 
   /* GPIO configuration of ETH2_RESET on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_20 (pin C8) */
   rgpio_pin_config_t ETH2_RESET_config = {
       .pinDirection = kRGPIO_DigitalOutput,
       .outputLogic = 1U,
   };
   /* Initialize GPIO functionality on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_20 (pin C8) */
   RGPIO_PinInit(RGPIO1, 20U, &ETH2_RESET_config);
 
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_AD_30_NETC_EMDC,            /* GPIO_AD_30 is configured as NETC_EMDC */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_AD_31_NETC_EMDIO,           /* GPIO_AD_31 is configured as NETC_EMDIO */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B1_27_NETC_PINMUX_ETH2_TXD00,  /* GPIO_EMC_B1_27 is configured as NETC_PINMUX_ETH2_TXD00 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B1_28_NETC_PINMUX_ETH2_TX_EN,  /* GPIO_EMC_B1_28 is configured as NETC_PINMUX_ETH2_TX_EN */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B1_29_NETC_PINMUX_ETH2_TX_CLK,  /* GPIO_EMC_B1_29 is configured as NETC_PINMUX_ETH2_TX_CLK */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B1_30_NETC_PINMUX_ETH2_RXD00,  /* GPIO_EMC_B1_30 is configured as NETC_PINMUX_ETH2_RXD00 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B1_31_NETC_PINMUX_ETH2_RXD01,  /* GPIO_EMC_B1_31 is configured as NETC_PINMUX_ETH2_RXD01 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B1_32_NETC_PINMUX_ETH2_RX_DV,  /* GPIO_EMC_B1_32 is configured as NETC_PINMUX_ETH2_RX_DV */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B1_33_NETC_PINMUX_ETH2_RX_ER,  /* GPIO_EMC_B1_33 is configured as NETC_PINMUX_ETH2_RX_ER */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B1_34_NETC_PINMUX_ETH2_RXD02,  /* GPIO_EMC_B1_34 is configured as NETC_PINMUX_ETH2_RXD02 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B1_35_NETC_PINMUX_ETH2_RXD03,  /* GPIO_EMC_B1_35 is configured as NETC_PINMUX_ETH2_RXD03 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B1_36_NETC_PINMUX_ETH2_TXD03,  /* GPIO_EMC_B1_36 is configured as NETC_PINMUX_ETH2_TXD03 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B1_37_NETC_PINMUX_ETH2_TXD02,  /* GPIO_EMC_B1_37 is configured as NETC_PINMUX_ETH2_TXD02 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B1_38_NETC_PINMUX_ETH2_RX_CLK,  /* GPIO_EMC_B1_38 is configured as NETC_PINMUX_ETH2_RX_CLK */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B2_01_NETC_PINMUX_ETH0_RXD02,  /* GPIO_EMC_B2_01 is configured as NETC_PINMUX_ETH0_RXD02 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B2_02_NETC_PINMUX_ETH0_RXD03,  /* GPIO_EMC_B2_02 is configured as NETC_PINMUX_ETH0_RXD03 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B2_03_NETC_PINMUX_ETH0_TXD02,  /* GPIO_EMC_B2_03 is configured as NETC_PINMUX_ETH0_TXD02 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B2_04_NETC_PINMUX_ETH0_TXD03,  /* GPIO_EMC_B2_04 is configured as NETC_PINMUX_ETH0_TXD03 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B2_05_NETC_PINMUX_ETH0_TXD00,  /* GPIO_EMC_B2_05 is configured as NETC_PINMUX_ETH0_TXD00 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B2_06_NETC_PINMUX_ETH0_TXD01,  /* GPIO_EMC_B2_06 is configured as NETC_PINMUX_ETH0_TXD01 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B2_07_NETC_PINMUX_ETH0_TX_EN,  /* GPIO_EMC_B2_07 is configured as NETC_PINMUX_ETH0_TX_EN */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B2_08_NETC_PINMUX_ETH0_TX_CLK,  /* GPIO_EMC_B2_08 is configured as NETC_PINMUX_ETH0_TX_CLK */
       1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B2_08 */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B2_09_NETC_PINMUX_ETH0_RXD00,  /* GPIO_EMC_B2_09 is configured as NETC_PINMUX_ETH0_RXD00 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B2_10_NETC_PINMUX_ETH0_RXD01,  /* GPIO_EMC_B2_10 is configured as NETC_PINMUX_ETH0_RXD01 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B2_11_NETC_PINMUX_ETH0_RX_DV,  /* GPIO_EMC_B2_11 is configured as NETC_PINMUX_ETH0_RX_DV */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B2_12_NETC_PINMUX_ETH0_RX_ER,  /* GPIO_EMC_B2_12 is configured as NETC_PINMUX_ETH0_RX_ER */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_AON_15_GPIO1_IO15,          /* GPIO_AON_15 is configured as GPIO1_IO15 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_AON_20_GPIO1_IO20,          /* GPIO_AON_20 is configured as GPIO1_IO20 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinConfig(
       IOMUXC_GPIO_AD_30_NETC_EMDC,            /* GPIO_AD_30 PAD functional properties : */
       0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                  Drive Strength Field: high driver
                                                  Pull / Keep Select Field: Pull Enable
                                                  Pull Up / Down Config. Field: Weak pull down
                                                  Open Drain Field: Disabled
                                                  Force ibe off Field: Disabled */
   IOMUXC_SetPinConfig(
       IOMUXC_GPIO_AD_31_NETC_EMDIO,           /* GPIO_AD_31 PAD functional properties : */
       0x16U);                                 /* Slew Rate Field: Fast Slew Rate
                                                  Drive Strength Field: high driver
                                                  Pull / Keep Select Field: Pull Enable
                                                  Pull Up / Down Config. Field: Weak pull down
                                                  Open Drain Field: Enabled
                                                  Force ibe off Field: Disabled */
 }
 
 
