nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt1186/common/pin_mux/pin_mux.c
 /*
  * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
 BOARD_InitPWMPins:
 - options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
 - pin_list:
   - {pin_num: D7, peripheral: PWM4, signal: 'A, 0', pin_signal: GPIO_EMC_B1_12}
   - {pin_num: E3, peripheral: PWM4, signal: 'B, 0', pin_signal: GPIO_EMC_B1_13}
   - {pin_num: E5, peripheral: PWM4, signal: 'A, 1', pin_signal: GPIO_EMC_B1_14}
   - {pin_num: C2, peripheral: PWM4, signal: 'A, 2', pin_signal: GPIO_EMC_B1_17}
  * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
  */
 
 /* FUNCTION ************************************************************************************************************
  *
  * Function Name : BOARD_InitPWMPins, assigned for the Cortex-M33 core.
  * Description   : Configures pin routing and optionally pin electrical features.
  *
  * END ****************************************************************************************************************/
 void BOARD_InitPWMPins(void) {
   CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
 
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B1_12_FLEXPWM4_PWMA00,  /* GPIO_EMC_B1_12 is configured as FLEXPWM4_PWMA00 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B1_13_FLEXPWM4_PWMB00,  /* GPIO_EMC_B1_13 is configured as FLEXPWM4_PWMB00 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B1_14_FLEXPWM4_PWMA01,  /* GPIO_EMC_B1_14 is configured as FLEXPWM4_PWMA01 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B1_17_FLEXPWM4_PWMA02,  /* GPIO_EMC_B1_17 is configured as FLEXPWM4_PWMA02 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
 }
 
 
 /*
  * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
 BOARD_InitSPIPins:
 - options: {createDeInit: 'true', callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
 - pin_list:
   - {pin_num: L3, peripheral: LPSPI4, signal: SCK, pin_signal: GPIO_EMC_B1_22, pdrv_config: High_Driver}
   - {pin_num: E1, peripheral: LPSPI4, signal: SIN, pin_signal: GPIO_EMC_B1_23, pull_down_pull_up_config: Pull_Up, pdrv_config: High_Driver}
   - {pin_num: H5, peripheral: LPSPI4, signal: SOUT, pin_signal: GPIO_EMC_B1_24, pull_down_pull_up_config: Pull_Up, pdrv_config: High_Driver}
   - {pin_num: L4, peripheral: LPSPI4, signal: PCS0, pin_signal: GPIO_EMC_B1_25, pdrv_config: High_Driver}
  * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
  */
 
 /* FUNCTION ************************************************************************************************************
  *
  * Function Name : BOARD_InitSPIPins, assigned for the Cortex-M33 core.
  * Description   : Configures pin routing and optionally pin electrical features.
  *
  * END ****************************************************************************************************************/
 void BOARD_InitSPIPins(void) {
   CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
 
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B1_22_LPSPI4_SCK,       /* GPIO_EMC_B1_22 is configured as LPSPI4_SCK */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B1_23_LPSPI4_SDI,       /* GPIO_EMC_B1_23 is configured as LPSPI4_SDI */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B1_24_LPSPI4_SDO,       /* GPIO_EMC_B1_24 is configured as LPSPI4_SDO */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B1_25_LPSPI4_PCS0,      /* GPIO_EMC_B1_25 is configured as LPSPI4_PCS0 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinConfig(
       IOMUXC_GPIO_EMC_B1_22_LPSPI4_SCK,       /* GPIO_EMC_B1_22 PAD functional properties : */
       0x08U);                                 /* PDRV Field: high driver
                                                  Pull Down Pull Up Field: PD
                                                  Open Drain Field: Disabled */
   IOMUXC_SetPinConfig(
       IOMUXC_GPIO_EMC_B1_23_LPSPI4_SDI,       /* GPIO_EMC_B1_23 PAD functional properties : */
       0x04U);                                 /* PDRV Field: high driver
                                                  Pull Down Pull Up Field: PU
                                                  Open Drain Field: Disabled */
   IOMUXC_SetPinConfig(
       IOMUXC_GPIO_EMC_B1_24_LPSPI4_SDO,       /* GPIO_EMC_B1_24 PAD functional properties : */
       0x04U);                                 /* PDRV Field: high driver
                                                  Pull Down Pull Up Field: PU
                                                  Open Drain Field: Disabled */
   IOMUXC_SetPinConfig(
       IOMUXC_GPIO_EMC_B1_25_LPSPI4_PCS0,      /* GPIO_EMC_B1_25 PAD functional properties : */
       0x08U);                                 /* PDRV Field: high driver
                                                  Pull Down Pull Up Field: PD
                                                  Open Drain Field: Disabled */
 }
 
 
 /* FUNCTION ************************************************************************************************************
  *
  * Function Name : BOARD_InitSPIPins_deinit, assigned for the Cortex-M33 core.
  * Description   : This is a de-initialization function for 'BOARD_InitSPIPins' function.
  * It sets all pins features (routing, direction and electrical) to their after-reset state.
  * It also tries to route the previous peripheral signals to their default pins.
  *
  * END ****************************************************************************************************************/
 void BOARD_InitSPIPins_deinit(void) {
   CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
 
   /* GPIO configuration on GPIO_EMC_B1_22 (pin L3) */
   rgpio_pin_config_t gpio2_pinL3_config = {
       .pinDirection = kRGPIO_DigitalInput,
       .outputLogic = 0U,
   };
   /* Initialize GPIO functionality on GPIO_EMC_B1_22 (pin L3) */
   RGPIO_PinInit(RGPIO2, 22U, &gpio2_pinL3_config);
   /* Configures GPIO pin interrupt/DMA request on GPIO_EMC_B1_22 (pin L3) */
   RGPIO_SetPinInterruptConfig(RGPIO2, 22U, kRGPIO_InterruptOutput0, kRGPIO_InterruptOrDMADisabled);
 
   /* GPIO configuration on GPIO_EMC_B1_23 (pin E1) */
   rgpio_pin_config_t gpio2_pinE1_config = {
       .pinDirection = kRGPIO_DigitalInput,
       .outputLogic = 0U,
   };
   /* Initialize GPIO functionality on GPIO_EMC_B1_23 (pin E1) */
   RGPIO_PinInit(RGPIO2, 23U, &gpio2_pinE1_config);
   /* Configures GPIO pin interrupt/DMA request on GPIO_EMC_B1_23 (pin E1) */
   RGPIO_SetPinInterruptConfig(RGPIO2, 23U, kRGPIO_InterruptOutput0, kRGPIO_InterruptOrDMADisabled);
 
