nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt1186/common/pin_mux/pin_mux.c
   /* GPIO configuration on GPIO_EMC_B1_24 (pin H5) */
   rgpio_pin_config_t gpio2_pinH5_config = {
       .pinDirection = kRGPIO_DigitalInput,
       .outputLogic = 0U,
   };
   /* Initialize GPIO functionality on GPIO_EMC_B1_24 (pin H5) */
   RGPIO_PinInit(RGPIO2, 24U, &gpio2_pinH5_config);
   /* Configures GPIO pin interrupt/DMA request on GPIO_EMC_B1_24 (pin H5) */
   RGPIO_SetPinInterruptConfig(RGPIO2, 24U, kRGPIO_InterruptOutput0, kRGPIO_InterruptOrDMADisabled);
 
   /* GPIO configuration on GPIO_EMC_B1_25 (pin L4) */
   rgpio_pin_config_t gpio2_pinL4_config = {
       .pinDirection = kRGPIO_DigitalInput,
       .outputLogic = 0U,
   };
   /* Initialize GPIO functionality on GPIO_EMC_B1_25 (pin L4) */
   RGPIO_PinInit(RGPIO2, 25U, &gpio2_pinL4_config);
   /* Configures GPIO pin interrupt/DMA request on GPIO_EMC_B1_25 (pin L4) */
   RGPIO_SetPinInterruptConfig(RGPIO2, 25U, kRGPIO_InterruptOutput0, kRGPIO_InterruptOrDMADisabled);
 
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B1_22_GPIO2_IO22,       /* GPIO_EMC_B1_22 is configured as GPIO2_IO22 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B1_23_GPIO2_IO23,       /* GPIO_EMC_B1_23 is configured as GPIO2_IO23 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B1_24_GPIO2_IO24,       /* GPIO_EMC_B1_24 is configured as GPIO2_IO24 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B1_25_GPIO2_IO25,       /* GPIO_EMC_B1_25 is configured as GPIO2_IO25 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinConfig(
       IOMUXC_GPIO_EMC_B1_22_GPIO2_IO22,       /* GPIO_EMC_B1_22 PAD functional properties : */
       0x08U);                                 /* PDRV Field: high driver
                                                  Pull Down Pull Up Field: PD
                                                  Open Drain Field: Disabled */
   IOMUXC_SetPinConfig(
       IOMUXC_GPIO_EMC_B1_23_GPIO2_IO23,       /* GPIO_EMC_B1_23 PAD functional properties : */
       0x08U);                                 /* PDRV Field: high driver
                                                  Pull Down Pull Up Field: PD
                                                  Open Drain Field: Disabled */
   IOMUXC_SetPinConfig(
       IOMUXC_GPIO_EMC_B1_24_GPIO2_IO24,       /* GPIO_EMC_B1_24 PAD functional properties : */
       0x08U);                                 /* PDRV Field: high driver
                                                  Pull Down Pull Up Field: PD
                                                  Open Drain Field: Disabled */
   IOMUXC_SetPinConfig(
       IOMUXC_GPIO_EMC_B1_25_GPIO2_IO25,       /* GPIO_EMC_B1_25 PAD functional properties : */
       0x08U);                                 /* PDRV Field: high driver
                                                  Pull Down Pull Up Field: PD
                                                  Open Drain Field: Disabled */
 }
 
 
 /*
  * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
 BOARD_InitLEDsPins:
 - options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
 - pin_list:
   - {pin_num: D2, peripheral: RGPIO2, signal: 'gpio_io, 11', pin_signal: GPIO_EMC_B1_11}
  * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
  */
 
 /* FUNCTION ************************************************************************************************************
  *
  * Function Name : BOARD_InitLEDsPins, assigned for the Cortex-M33 core.
  * Description   : Configures pin routing and optionally pin electrical features.
  *
  * END ****************************************************************************************************************/
 void BOARD_InitLEDsPins(void) {
   CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
 
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B1_11_GPIO2_IO11,       /* GPIO_EMC_B1_11 is configured as GPIO2_IO11 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
 }
 
 
 /*
  * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
 BOARD_InitBUTTONsPins:
 - options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
 - pin_list:
   - {pin_num: N14, peripheral: RGPIO4, signal: 'gpio_io, 12', pin_signal: GPIO_AD_12, slew_rate: Slow}
  * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
  */
 
 /* FUNCTION ************************************************************************************************************
  *
  * Function Name : BOARD_InitBUTTONsPins, assigned for the Cortex-M33 core.
  * Description   : Configures pin routing and optionally pin electrical features.
  *
  * END ****************************************************************************************************************/
 void BOARD_InitBUTTONsPins(void) {
   CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
 
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_AD_12_GPIO4_IO12,           /* GPIO_AD_12 is configured as GPIO4_IO12 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinConfig(
       IOMUXC_GPIO_AD_12_GPIO4_IO12,           /* GPIO_AD_12 PAD functional properties : */
       0x0EU);                                 /* Slew Rate Field: Fast Slew Rate
                                                  Drive Strength Field: high driver
                                                  Pull / Keep Select Field: Pull Enable
                                                  Pull Up / Down Config. Field: Weak pull up
                                                  Open Drain Field: Disabled
                                                  Force ibe off Field: Disabled */
 }
 
 
