nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt1186/common/pin_mux/pin_mux.c
 /* FUNCTION ************************************************************************************************************
  *
  * Function Name : BOARD_InitFLASHPins, assigned for the Cortex-M33 core.
  * Description   : Configures pin routing and optionally pin electrical features.
  *
  * END ****************************************************************************************************************/
 void BOARD_InitFLASHPins(void) {
   CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
   CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */
 
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_AON_21_FLEXSPI2_BUS2BIT_A_DQS,  /* GPIO_AON_21 is configured as FLEXSPI2_BUS2BIT_A_DQS */
       1U);                                    /* Software Input On Field: Force input path of pad GPIO_AON_21 */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_AON_22_FLEXSPI2_BUS2BIT_A_SS0_B,  /* GPIO_AON_22 is configured as FLEXSPI2_BUS2BIT_A_SS0_B */
       1U);                                    /* Software Input On Field: Force input path of pad GPIO_AON_22 */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_AON_23_FLEXSPI2_BUS2BIT_A_SCLK,  /* GPIO_AON_23 is configured as FLEXSPI2_BUS2BIT_A_SCLK */
       1U);                                    /* Software Input On Field: Force input path of pad GPIO_AON_23 */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_AON_24_FLEXSPI2_BUS2BIT_A_DATA00,  /* GPIO_AON_24 is configured as FLEXSPI2_BUS2BIT_A_DATA00 */
       1U);                                    /* Software Input On Field: Force input path of pad GPIO_AON_24 */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_AON_25_FLEXSPI2_BUS2BIT_A_DATA01,  /* GPIO_AON_25 is configured as FLEXSPI2_BUS2BIT_A_DATA01 */
       1U);                                    /* Software Input On Field: Force input path of pad GPIO_AON_25 */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_AON_26_FLEXSPI2_BUS2BIT_A_DATA02,  /* GPIO_AON_26 is configured as FLEXSPI2_BUS2BIT_A_DATA02 */
       1U);                                    /* Software Input On Field: Force input path of pad GPIO_AON_26 */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_AON_27_FLEXSPI2_BUS2BIT_A_DATA03,  /* GPIO_AON_27 is configured as FLEXSPI2_BUS2BIT_A_DATA03 */
       1U);                                    /* Software Input On Field: Force input path of pad GPIO_AON_27 */
 }
 
 
 /*
  * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
 BOARD_InitHYPERRAMPins:
 - options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
 - pin_list:
   - {pin_num: D13, peripheral: FLEXSPI1, signal: FLEXSPI_B_DQS, pin_signal: GPIO_SD_B2_05, software_input_on: Enable}
   - {pin_num: E11, peripheral: FLEXSPI1, signal: FLEXSPI_B_SS0_B, pin_signal: GPIO_SD_B2_06, software_input_on: Enable}
   - {pin_num: J11, peripheral: FLEXSPI1, signal: FLEXSPI_B_SCLK, pin_signal: GPIO_SD_B2_07, software_input_on: Enable}
   - {pin_num: G11, peripheral: FLEXSPI1, signal: FLEXSPI_B_DATA0, pin_signal: GPIO_SD_B2_08, software_input_on: Enable}
   - {pin_num: E12, peripheral: FLEXSPI1, signal: FLEXSPI_B_DATA1, pin_signal: GPIO_SD_B2_09, software_input_on: Enable}
   - {pin_num: F12, peripheral: FLEXSPI1, signal: FLEXSPI_B_DATA2, pin_signal: GPIO_SD_B2_10, software_input_on: Enable}
   - {pin_num: E13, peripheral: FLEXSPI1, signal: FLEXSPI_B_DATA3, pin_signal: GPIO_SD_B2_11, software_input_on: Enable}
   - {pin_num: G13, peripheral: FLEXSPI1, signal: FLEXSPI_B_DATA4, pin_signal: GPIO_SD_B2_00, software_input_on: Enable}
   - {pin_num: F14, peripheral: FLEXSPI1, signal: FLEXSPI_B_DATA5, pin_signal: GPIO_SD_B2_01, software_input_on: Enable}
   - {pin_num: F13, peripheral: FLEXSPI1, signal: FLEXSPI_B_DATA6, pin_signal: GPIO_SD_B2_02, software_input_on: Enable}
   - {pin_num: H11, peripheral: FLEXSPI1, signal: FLEXSPI_B_DATA7, pin_signal: GPIO_SD_B2_03, software_input_on: Enable}
  * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
  */
 
 /* FUNCTION ************************************************************************************************************
  *
  * Function Name : BOARD_InitHYPERRAMPins, assigned for the Cortex-M33 core.
  * Description   : Configures pin routing and optionally pin electrical features.
  *
  * END ****************************************************************************************************************/
 void BOARD_InitHYPERRAMPins(void) {
   CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
 
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_SD_B2_00_FLEXSPI1_BUS2BIT_B_DATA04,  /* GPIO_SD_B2_00 is configured as FLEXSPI1_BUS2BIT_B_DATA04 */
       1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B2_00 */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_SD_B2_01_FLEXSPI1_BUS2BIT_B_DATA05,  /* GPIO_SD_B2_01 is configured as FLEXSPI1_BUS2BIT_B_DATA05 */
       1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B2_01 */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_SD_B2_02_FLEXSPI1_BUS2BIT_B_DATA06,  /* GPIO_SD_B2_02 is configured as FLEXSPI1_BUS2BIT_B_DATA06 */
       1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B2_02 */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_SD_B2_03_FLEXSPI1_BUS2BIT_B_DATA07,  /* GPIO_SD_B2_03 is configured as FLEXSPI1_BUS2BIT_B_DATA07 */
       1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B2_03 */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_SD_B2_05_FLEXSPI1_BUS2BIT_B_DQS,  /* GPIO_SD_B2_05 is configured as FLEXSPI1_BUS2BIT_B_DQS */
       1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B2_05 */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_SD_B2_06_FLEXSPI1_BUS2BIT_B_SS0_B,  /* GPIO_SD_B2_06 is configured as FLEXSPI1_BUS2BIT_B_SS0_B */
       1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B2_06 */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_SD_B2_07_FLEXSPI1_BUS2BIT_B_SCLK,  /* GPIO_SD_B2_07 is configured as FLEXSPI1_BUS2BIT_B_SCLK */
       1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B2_07 */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_SD_B2_08_FLEXSPI1_BUS2BIT_B_DATA00,  /* GPIO_SD_B2_08 is configured as FLEXSPI1_BUS2BIT_B_DATA00 */
       1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B2_08 */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_SD_B2_09_FLEXSPI1_BUS2BIT_B_DATA01,  /* GPIO_SD_B2_09 is configured as FLEXSPI1_BUS2BIT_B_DATA01 */
       1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B2_09 */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_SD_B2_10_FLEXSPI1_BUS2BIT_B_DATA02,  /* GPIO_SD_B2_10 is configured as FLEXSPI1_BUS2BIT_B_DATA02 */
       1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B2_10 */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_SD_B2_11_FLEXSPI1_BUS2BIT_B_DATA03,  /* GPIO_SD_B2_11 is configured as FLEXSPI1_BUS2BIT_B_DATA03 */
       1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B2_11 */
 }
 
 
