nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt1186/common/pin_mux/pin_mux.c
 /*
  * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
 BOARD_InitEQDCPins:
 - options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
 - pin_list:
   - {pin_num: M9, peripheral: XBAR1, signal: 'IN, 36', pin_signal: GPIO_EMC_B2_19, software_input_on: Enable}
   - {pin_num: M8, peripheral: XBAR1, signal: 'IN, 37', pin_signal: GPIO_EMC_B2_20, software_input_on: Enable}
   - {pin_num: J14, peripheral: XBAR1, signal: 'IN, 23', pin_signal: GPIO_SD_B1_03, software_input_on: Enable}
  * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
  */
 
 /* FUNCTION ************************************************************************************************************
  *
  * Function Name : BOARD_InitEQDCPins, assigned for the Cortex-M33 core.
  * Description   : Configures pin routing and optionally pin electrical features.
  *
  * END ****************************************************************************************************************/
 void BOARD_InitEQDCPins(void) {
   CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
 
   BLK_CTRL_WAKEUPMIX->XBAR_DIR_CTRL1 = ((BLK_CTRL_WAKEUPMIX->XBAR_DIR_CTRL1 &
     (~(BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_23_MASK))) /* Mask bits to zero which are setting */
       | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_23(0x00U) /* IOMUXC XBAR_INOUT23 function direction select: XBAR_INOUT as input */
     );
   BLK_CTRL_WAKEUPMIX->XBAR_DIR_CTRL2 = ((BLK_CTRL_WAKEUPMIX->XBAR_DIR_CTRL2 &
     (~(BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL2_IOMUXC_XBAR_DIR_SEL_36_MASK | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL2_IOMUXC_XBAR_DIR_SEL_37_MASK))) /* Mask bits to zero which are setting */
       | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL2_IOMUXC_XBAR_DIR_SEL_36(0x00U) /* IOMUXC XBAR_INOUT36 function direction select: XBAR_INOUT as input */
       | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL2_IOMUXC_XBAR_DIR_SEL_37(0x00U) /* IOMUXC XBAR_INOUT37 function direction select: XBAR_INOUT as input */
     );
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B2_19_XBAR1_XBAR_INOUT36,  /* GPIO_EMC_B2_19 is configured as XBAR1_XBAR_INOUT36 */
       1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B2_19 */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B2_20_XBAR1_XBAR_INOUT37,  /* GPIO_EMC_B2_20 is configured as XBAR1_XBAR_INOUT37 */
       1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B2_20 */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_SD_B1_03_XBAR1_XBAR_INOUT23,  /* GPIO_SD_B1_03 is configured as XBAR1_XBAR_INOUT23 */
       1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_03 */
 }
 
 
 /*
  * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
 BOARD_InitI2CPins:
 - options: {createDeInit: 'true', callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
 - pin_list:
   - {pin_num: M9, peripheral: LPI2C3, signal: SCL, pin_signal: GPIO_EMC_B2_19, software_input_on: Enable, pdrv_config: Normal_Driver, open_drain: Enable}
   - {pin_num: M8, peripheral: LPI2C3, signal: SDA, pin_signal: GPIO_EMC_B2_20, software_input_on: Enable, pdrv_config: Normal_Driver, open_drain: Enable}
  * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
  */
 
 /* FUNCTION ************************************************************************************************************
  *
  * Function Name : BOARD_InitI2CPins, assigned for the Cortex-M33 core.
  * Description   : Configures pin routing and optionally pin electrical features.
  *
  * END ****************************************************************************************************************/
 void BOARD_InitI2CPins(void) {
   CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
 
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B2_19_LPI2C3_SCL,       /* GPIO_EMC_B2_19 is configured as LPI2C3_SCL */
       1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B2_19 */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B2_20_LPI2C3_SDA,       /* GPIO_EMC_B2_20 is configured as LPI2C3_SDA */
       1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B2_20 */
   IOMUXC_SetPinConfig(
       IOMUXC_GPIO_EMC_B2_19_LPI2C3_SCL,       /* GPIO_EMC_B2_19 PAD functional properties : */
       0x1AU);                                 /* PDRV Field: normal driver
                                                  Pull Down Pull Up Field: PD
                                                  Open Drain Field: Enabled */
   IOMUXC_SetPinConfig(
       IOMUXC_GPIO_EMC_B2_20_LPI2C3_SDA,       /* GPIO_EMC_B2_20 PAD functional properties : */
       0x1AU);                                 /* PDRV Field: normal driver
                                                  Pull Down Pull Up Field: PD
                                                  Open Drain Field: Enabled */
 }
 
 
 /* FUNCTION ************************************************************************************************************
  *
  * Function Name : BOARD_InitI2CPins_deinit, assigned for the Cortex-M33 core.
  * Description   : This is a de-initialization function for 'BOARD_InitI2CPins' function.
  * It sets all pins features (routing, direction and electrical) to their after-reset state.
  * It also tries to route the previous peripheral signals to their default pins.
  *
  * END ****************************************************************************************************************/
 void BOARD_InitI2CPins_deinit(void) {
   CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
 
   /* GPIO configuration on GPIO_EMC_B2_19 (pin M9) */
   rgpio_pin_config_t gpio3_pinM9_config = {
       .pinDirection = kRGPIO_DigitalInput,
       .outputLogic = 0U,
   };
   /* Initialize GPIO functionality on GPIO_EMC_B2_19 (pin M9) */
   RGPIO_PinInit(RGPIO3, 29U, &gpio3_pinM9_config);
   /* Configures GPIO pin interrupt/DMA request on GPIO_EMC_B2_19 (pin M9) */
   RGPIO_SetPinInterruptConfig(RGPIO3, 29U, kRGPIO_InterruptOutput0, kRGPIO_InterruptOrDMADisabled);
 
   /* GPIO configuration on GPIO_EMC_B2_20 (pin M8) */
   rgpio_pin_config_t gpio3_pinM8_config = {
       .pinDirection = kRGPIO_DigitalInput,
       .outputLogic = 0U,
   };
   /* Initialize GPIO functionality on GPIO_EMC_B2_20 (pin M8) */
   RGPIO_PinInit(RGPIO3, 30U, &gpio3_pinM8_config);
   /* Configures GPIO pin interrupt/DMA request on GPIO_EMC_B2_20 (pin M8) */
   RGPIO_SetPinInterruptConfig(RGPIO3, 30U, kRGPIO_InterruptOutput0, kRGPIO_InterruptOrDMADisabled);
 
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B2_19_GPIO3_IO29,       /* GPIO_EMC_B2_19 is configured as GPIO3_IO29 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinMux(
       IOMUXC_GPIO_EMC_B2_20_GPIO3_IO30,       /* GPIO_EMC_B2_20 is configured as GPIO3_IO30 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */
   IOMUXC_SetPinConfig(
       IOMUXC_GPIO_EMC_B2_19_GPIO3_IO29,       /* GPIO_EMC_B2_19 PAD functional properties : */
       0x08U);                                 /* PDRV Field: high driver
                                                  Pull Down Pull Up Field: PD
                                                  Open Drain Field: Disabled */
   IOMUXC_SetPinConfig(
       IOMUXC_GPIO_EMC_B2_20_GPIO3_IO30,       /* GPIO_EMC_B2_20 PAD functional properties : */
       0x08U);                                 /* PDRV Field: high driver
                                                  Pull Down Pull Up Field: PD
                                                  Open Drain Field: Disabled */
 }
 
 
